# Pandas I - 14/07

Happy coding üí™üèΩ

Empezamos los ejercicios de pair programming con Pandas. En esta lecci√≥n hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.

El objetivo de la clase de hoy ser√° crear unos cu√°ntos DataFrames y Series a trav√©s de los siguientes ejercicios:

1. ¬øQu√© diferencia hay entre una Serie y un DataFrame?

Una Serie tiene una estructura unidimensional, mientras que un DataFrame es bidimensional.

2. Momento de trabajar con Series. Contestad a las siguientes preguntas:
* Crea dos listas:
  * Una que se llame "valores" que tenga 7 n√∫meros aleatorios.
  * Otra que se llame "indices" que tenga 7 strings que se llamen como los d√≠as de la semana.
* A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los √≠ndices de la Serie.
* A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el m√©todo zip que nos permite iterar por dos listas a la vez. M√°s informci√≥n sobre este m√©todo aqu√≠.
* Crea una Serie con el diccionario creado en el punto anterior.
* ¬øQu√© forma tiene esta √∫ltima Serie?
* ¬øQu√© tipo de datos tiene?
* ¬øQu√© tama√±o tiene?
* ¬øCu√°les son los √≠ndices de la Serie?
* ¬øY los values?
* Extraed el valor para el √≠ndice "lunes"
* Extraed el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles".
* Extraed el valor para el √≠ndice "lunes" y "domingo".

In [1]:
import pandas as pd
import numpy as np

In [3]:
valores = [8,12,25,6,10,4,32]
indices = ["Lunes","Martes", "Mi√©rcoles","Jueves","Viernes", "S√°bado","Domingo"]
serie1 = pd.Series(valores, index = [indices])
print(serie1)

Lunes         8
Martes       12
Mi√©rcoles    25
Jueves        6
Viernes      10
S√°bado        4
Domingo      32
dtype: int64

In [4]:
diccionario = dict(zip(indices, valores))
print(diccionario)

{'Lunes': 8, 'Martes': 12, 'Mi√©rcoles': 25, 'Jueves': 6, 'Viernes': 10, 'S√°bado': 4, 'Domingo': 32}

In [6]:
serie2 = pd.Series(diccionario)
print(serie2)

Lunes         8
Martes       12
Mi√©rcoles    25
Jueves        6
Viernes      10
S√°bado        4
Domingo      32
dtype: int64

In [9]:
print("El tama√±o es", serie2.size)
print("La forma es", serie2.shape)
print("La dimension es", serie2.ndim)
print("El tipo de dato es", serie2.dtype)
print("los √≠ndices son", serie2.index)
print("los values son", serie2.values)

El tama√±o es 7
La forma es (7,)
La dimension es 1
El tipo de dato es int64
los √≠ndices son Index(['Lunes', 'Martes', 'Mi√©rcoles', 'Jueves', 'Viernes', 'S√°bado',
       'Domingo'],
      dtype='object')
los values son [ 8 12 25  6 10  4 32]

In [12]:
serie2["Lunes"]

8

In [14]:
serie2[["Lunes","Martes","Mi√©rcoles"]]

Lunes         8
Martes       12
Mi√©rcoles    25
dtype: int64

In [16]:
serie2[["Lunes","Domingo"]]

Lunes       8
Domingo    32
dtype: int64

3. Es el turno de los DataFrames
* Cread un array de dos dimensiones con 4 filas y 3 columnas.
* Convertid el array en un DataFrame donde las columnas se llamen "Espa√±a", "Francia" e "Italia".
* Descargad el archivo "medallas" y cargad el DataFrame con la siguiente l√≠nea de c√≥digo:
```python
df = pd.read_csv("medallas.csv", index_col=["Pa√≠s"])
```
    üìå NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.
* Usando el loc extraed todas las columnas de la fila de Tailandia.
* Usando el loc extraed todas las columnas de China e Ir√°n.
* Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir√°n.
* Usando el iloc extraed la informaci√≥n de la India. Devolved todas las columnas.
* Usando el iloc extraed todas las columnas de los paises que est√©n en posici√≥n impar. La primera que nos tendr√≠a que salir es Jap√≥n y la √∫ltima Corea del Norte.
* Utilizando el c√≥digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
* Contestad a las siguientes preguntas:
  * ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
  * ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro y m√°s de 1000 de plata?
  * ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?
* Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.
* Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa√≠s.

In [21]:
medallas_csv = "data/medallas.csv" # As√≠ podemos acceder al fichero solo poniendo esta variable.

In [17]:
a1 =np.random.randint(0,100,(4,3))
a1

array([[52,  8, 91],
       [11, 66, 29],
       [58, 21, 16],
       [41,  7, 91]])

In [18]:
df_array = pd.DataFrame(a1, columns = ["Espa√±a", "Francia", "Italia"])
print(df_array)

   Espa√±a  Francia  Italia
0      52        8      91
1      11       66      29
2      58       21      16
3      41        7      91

In [26]:
df = pd.read_csv(medallas_csv, index_col=["Pa√≠s"])
print(df)

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

In [27]:
df.loc["Tailandia", :]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [28]:
df.loc[["China", "Ir√°n"], :]

       Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China           1  1473    994     720
Ir√°n            4   179    181     197

In [29]:
df.loc[["China", "Ir√°n"], "Oro" :]

        Oro  Plata  Bronce
Pa√≠s
China  1473    994     720
Ir√°n    179    181     197

In [30]:
df.iloc[5, :]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [34]:
df.iloc[1::2, :]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n                     2  1032   1037     985
Ir√°n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [32]:
df.loc[df["Oro"] > 30]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

In [37]:
condicion1 = df["Oro"] > 200
condicion2 = df["Plata"] > 1000
df.loc[condicion1 & condicion2]

       Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n           2  1032   1037     985

In [38]:
condicion3 = df["Bronce"] > 700
df.loc[condicion1 | condicion3]

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [40]:
df = df.drop("Unnamed: 0", axis = 1)
print(df)

                  Oro  Plata  Bronce
Pa√≠s
China            1473    994     720
Jap√≥n            1032   1037     985
Corea del Sur     745    663     827
Ir√°n              179    181     197
Kazajist√°n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip√©i       99    144     276
Corea del Norte    91    120     235

In [41]:
df["total"] = df["Oro"] + df["Plata"] + df["Bronce"]
print(df)

                  Oro  Plata  Bronce  total
Pa√≠s
China            1473    994     720   3187
Jap√≥n            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Ir√°n              179    181     197    557
Kazajist√°n        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taip√©i       99    144     276    519
Corea del Norte    91    120     235    446